{"pageProps":{"frontmatter":{"title":"Parish Choir","description":"Parish Choir","date":"April 16, 2020"},"post":{"content":"\nThe Parish choir sings at the 7.00am and 6.00pm mass on every\n\n\nSunday. This choir has been part of the parish since the inception\n\n\nof the church.  This choir sings for church functions, weddings, requiem masses, anniversary services and so on. We have 11 members in the choir. Please contact the choir coordinator for booking for any events. \n\n\nChoir coordinator – Mrs. Joyce Henry\n\n\nOrganist – Mrs. Surani Mendis\n\n\n**Contact Us / Join us:**\n\nMrs. Joyce Henry 2506186\n\nMrs. Suwini Abesundara 2582895, 0775917000\n\n\n## Youth Choir\n\nThe Youth Choir was formed in 2014 under the. Then parish priest, Rev. Fr. Sunil De Silva. The need for youth participation at services was the primary objective of this group. Around 5 members accompanied and led by Nuran Gomez was the Initial.choir. This choir sings for 2 masses ......every alternate week on a Saturday at 6.15 pm.\n\n\nSanchia Steinwall - coordinator \n\n\n* Takes part in joint choir services of the  church.\n\n\n* Takes part in the parish Christmas carols\n\n\n* Sings for the 6.15 pm , every alternate saturday.\n\n\n**Contact Us / Join us:**\n\n\nsanchiasteinwall [at] gmail.com\n\n\nnurangomez [at] hotmail.com   0712738255\n\n## Childrens Choir\n\nThe need for a children's choir arose due to commencing of a children's mass at 10.30 am which commenced in 2008 under the then parish priest ..Rev. Fr. Srian Ranasinghe. Members from Sunday school were invited to join after an audition..\n\n\nCurrently...we have around 25 members who sing with us for the 10.30 am mass  \n\n\nChoir coordinator- Nirasha Gomez\n\n* sings for 10.30 mass\n* Takes part in Parish carols\n* Accompanies the Nativity play.\n* Sings for first Holy communion service \n\n\nWe hope to organise a professional to come and train the children once a month so as to cultivate their interest further and gear them to later join the youth choir \n\n**Contact Us / Join us:**\n\nNirasha \n0777818970 WhatsApp \n0777280759\n\n\nnirashagomez [at] hotmail.com\n\n\n## St. Mary’s Choral Group\n\nThe present St. Mary&#39;s Choral Group began as the Youth Choir of St. Mary&#39;s Church in 1973 when\nRedemptorist Priests Rev. Fr. Gino Henriques &amp; Rev. Fr. Shanti Abeysingha conducted a youth\nprogram at St Mary&#39;s and introduced a more vibrant style of music to the Mass. The parish priest at that time\nwas Fr. Basil Weeratunge, and his Assistant was Rev. Fr. Reginald Saparamadhu. It was in many\nways an off-shoot of the St. Mary&#39;s Choral Group (SMCG) and Youth Choir begun by the Rome-\nordained Rev. Fr. Claver Perera when he was Assistant Parish Priest, in 1967 as it comprised mostly\nthe members of those choirs.\n\nThe initial selection of the youth choir music comprised of songs such as; *My Sweet Lord, I&#39;d like to teach the world to sing* , and selections from the off-Broadway musical *Godspell*.\n\nThe choir grew informally by word of mouth, the average age being 19. Soon the choir was singing at\nthe 8.30am Sunday mass, continuing to call themselves the Youth Choir - maybe justified by the\nselection of music and youthful attitude of its members some of whom may not technically have\nbeen youth anymore! Perhaps the name was also prompted by the fact that St Mary’s has for many\nyears prided itself in having an outstanding Church Choir conducted at that time by renowned late\nProf. Earle de Fonseka with a membership of many renowned singers including the late Lorraine\nAbeysekera, Bede de Zilwa, and Mary Anne David - the last still contributes to the music world.\nHence the label youth choir was more an aspect of differentiation!\n\nThough it initially began with guitars, there was the addition of an organ which accompanied a\nmixture of modern songs and ballads such as He aint heavy he’s my brother and songs by the\nBeatles, Bread, Blood Sweat and Tears and Queen. More instruments such as bass and electric\nguitars, saxophone, piano, clarinet and flute were added in 1978.\n\nIn 1980 Fr. Claver, the new parish priest guided the Youth Choir and introduced serious mixed voice\nchoral harmonies. He further shared his experience in Italy. Fr. Claver built up the Choir&#39;s repertoire\nin Choral music and plainchant. The Parish invested in a Viscount Domus 8 organ for the church,\nfurther enriching the standard of the choir. In 1986 the choir under the direction of Fr. Claver,\nreleased its first cassette titled Pass it On which was popular and widely sought.\n\nThe choir went on to perform at concert venues, hotels in Colombo, Choral festivals and at the\nNational Seminary in Ampitiya. A major milestone was its participation in the Mozart Death\nBicentenary Choral Festival held at the Anglican Cathedral of Christ the Living Saviour by the late\nKalasuri Lylie Godridge. The introduction of a Yamaha EL90, enhanced the singing further with a\nwider repertoire.\n\nIn June 2007 the choir changed its name to St. Mary&#39;s Choral Group or SMCG, a name dating from\nFr. Claver&#39;s original male voice choir of 1967. The choir still sings at the 8.30am Sunday Eucharistic\nCelebration which is its primary function.\n\nIt also sings for the Church Feast, selected other major Feasts of the Church, Easter Tridium services\nthe annual Carol Service, and Christmas Midnight Mass. Most of its current members are non-\nparishioners, and are students or working professionals, giving of their time and talent. It could be\nsaid that the secret of its continuity and success in singing comes from a common love of music, and\ngood camaraderie and a solid foundation laid by Fr. Claver and many of its past conductors /\ndirectors. By the presence of several generations of its past and present members continuing to\ncontribute and sing for the love of it and in the realisation that good music, makes the liturgy more\ninspirational. The challenge it faces is the need to keep the momentum with bringing in new\nmembers, new thinking ,and expansion of its repertoire ,to be constantly innovating so that\nespecially the liturgy would be living and evolving for the better.\n\n\n<div class=\"col-8\" style=\"margin:auto\">\n\n![St. Mary’s Choral Group](choral_group.jpeg)\n\n</div>","excerpt":""},"previousPost":{"slug":"holy-child","frontmatter":{"title":"Holy Child","description":"Test page","date":"April 16, 2020"},"excerpt":"","content":"\n# Holy Childhood Society\n\nRev. Fr. Felician Ranjith Perera the Parish Priest inaugurated the Holy Childhood Cell at St Mary's Church Bambalapitiya, in February 2016. Mrs. Amali De Silva was requested to assist the children with the activities of Holy Childhood Society. Thereafter the Coordinator for Colombo South Deanery- Rev. Fr. Sashika Manoj Rodrigo, was contacted and the Animators Mrs. Amali De Silva, & Dinali De Silva went through two, three-day in house training programs in November 2016 and May 2017, to familiarize with the expectations of the society. The Holy Childhood Society assists Christian children from the age group of six (6) years to fourteen (14) years, towards a deeper and stronger experience of the faith through spiritual communion with Christ & self-boosting activities, while respecting the other. Thereafter the children were led with many activities which are briefed below.\n\n**Animators -\t Mrs. Amali De Silva** \n* Mrs. Sonali Jayatunga \n* Mrs. Indrani George \n* Miss Dinali De Silva \n* Miss. Jasmine Sinnappan \n* Julian Amanda Shevani. \n\n* President - Miss Rashali Sebastian 2017 - 2020 \n* Secretary - Miss Senuthmi Fernando 2017 - 2020 \n* Treasurers - Master Shiven Perera & Kisal Herath 2017 – 2020\n\n**Members:**\nRashali Sebastian, Senuthmi Fernando, Shiven Perera, Kisal Herath, Kevon Perera, Emma & Emmal Jayasinghe, Senuki Perera, Dinelie Wijesinghe, Sanduli Perera, Sahan Rajakaruna, Kiara Emmanuel Nicole Dominic, Mickaela Sathiyendrah, Dominic Soris, Praheeth Fernando, Treshan Motha, Shayani Rajakaruna, Amadie Fonseka, Senali Krishnan, Danidu Herath, Senan Fernando Asaka Fernando Amaya Henry, Dushyank Wijesinghe, Kevin Charles, Deanne Jayamaha, Dillon Jayamaha, Jenilin Jeneiron & Avelin Walter, Triidev & Thrisha Muttiah, Trevonie Daniel, Shirley & Adrina George, Mithun & Michelle Joseph, Methuli Kahatapiyarachchi, Sarah & James Chelliah, Kishani & Sneha Perera, Himaya & Daniru Fernando\n\n**Holy Childhood Society meets - Every 2nd & 4th Sunday of the Month**\nWe conduct and practice Motivational methods to daily prayers To accept one another as an own brother / sister, eradicate social status.\n\n**Events**\n\nKids participate in Archdiocesan level , Denary level and Parish level activities.\n\n**Archdiocesan:**\n* Annual Art competition /Bible Quiz \n* Carol Singing Folk Singing competitions \n* Drama\n* Essay competitions and Children helping Children Program \n* Annual Prize Giving. \n\n**Colombo South Deanery:**\n* Lenten way of the Cross & Geetha Bhawana \n* Sinhala & Tamil New Year celebrations \n* Kite festival \n* Activity Day /\n* Rosary Rally \n* Christmas Party & felicitation of Animators.\n\n **Parish :** \n* We meet on 2nd & 4th Sunday - 11:30 a.m. \n* Organize & participate in the four (4) Pontifical Mission Sundays - (Holy Childhood Sunday/ Popes Day / Indigenous Clergy Day / Mission Sunday) Awarding of Badge of Permanency \n* Cookery & craft days\n* Lenten way of the Cross\n* Children helping children program -(Donate books & Dry rations through sacrifice) \n* Radio Presentations, motivational methods to daily prayers \n* Acts of charity\n* Fund raisers \n* Sale of Advent Calendars \n* respect & well-being towards the other & society.\n\n**Plan for the year (2021,** \nWe have several activities planned throughout the year, watch this space for updates. So far we have the following, \n* January 17th - Holy Childhood Sunday – Radio Presentation\n* Feb/March - Lenten Way of the Cross April/May - Sinhala and Tamil New Year celebrations and Children helping children program\n* May - Recitation of the Family Rosary and Rosary rally \n* August - Activity day and kite festival \n* September - Month of literacy to learn more about lives of saints Church Fathers \n* October - Scriptural bases/ church traditions regarding Mother Mary \n* November - Offering of masses for the dearly departed\n* December - Children helping children program\n\n** Contact Information for more information or to Join:** \nAmali De Silva - 0777425015\n\n"},"nextPost":null},"__N_SSG":true}