{"pageProps":{"frontmatter":{"title":"Parish Pastoral Council and Sub Committees","description":"Parish Pastoral Council and Sub Committees","date":"April 16, 2020"},"post":{"content":"\n**There are several Sub committees instituted under the Parish Pastoral Council .**\n\n\nThe parish pastoral council at St Mary's was established during its early days to assist the parish priest to administer and develop the various aspects of the parish life . It consists of eight  sub  comities headed by parishioners to look after and assist the parish priest in work related to all pastoral and other activities of the  parish . \n\n\nThe council is established for a 5 year term and consists of a mix of members appointed by the parish priest and elected by a general assembly of parishioners . The current council was established in August of 2019 and consists of 26 Members representing all associations and solidarities .\n\n\nThe current Parish pastoral Council Includes, \n\n\n- **Patron : Fr Trever Martin**\n\n- **Secretory :  Mario De Alwis**\n\n- **Assistant Secretaries :  Glen Seneviratne     &     Nirasha Gomez** \n\n\nMeeting times: The Council meets each month on the third Thursday at 6.30 PM . \n\n\nShould any parishioner have any issues ,Suggestions or activities to be taken up  at the councils meetings please forward it by mail to the secretory by e-mail on or before  the third Monday of each month   to ( mario@mas.kitchen ) \n\n\n\n* Establishing the Church security system\n* Supporting needy parishioners during the pandemic \n* Distribution of food during lock down \n* Organizing online Sunday  Masses for the parish during Lock down \n* Supporting the Renovation of the Grotto \n\n\nUnder the Parish Council there are several sub committees instituted. \n\n* Liturgy Committee \n\n## Liturgy Committee\n\n\nLiturgy, is the heart of the catholic church.\n\n\nIt describes all acts of worship that take place within the catholic Church. It means divine worship, all rituals related to proclamation of the Gospel and active charity.\n\n\nThe liturgy committee is the avenue for communication between the different groups in the parish.\n\n\nIt can be grouped in to 4 areas.\n\n*   Preparation \n*   Coordination \n*   Formation \n*   Evaluation\n\nThe Liturgy Committee is Headed by. Nirasha Gomez and it’s members include, \n\n\n\n*   Nirasha Gomez \n*   Shalini Perera \n*   Eshantha de Andrado \n*   Michele Fonseka \n*   Joyce Henry \n*   Monica Jayawickrema \n*   Christobel Ondaajee \n*   Sharron Steinwall \n*   Sureeni Fernando\n*   Rev. Sr. Henrietta\n*   Rev. Sr. Euphrasia\n*   Melony Nanayakkara\n\nThere are no special meeting days however members get together for special occasions to serve the church. The team works on the following areas, \n\n* Choosing, selecting and preparing readers for all masses.\n* Overseeing and changing of altar linen.\n* Attending mass leaflets. \n* Selecting appropriate hymns for services, organizing choirs , Organists etc.\n* Assisting wedding parties re. liturgical formalities \n* coordinating with the Parish Priest re. Feasts and Special events in church .\n\n","excerpt":""},"previousPost":{"slug":"sunday-school","frontmatter":{"title":"Sunday School","description":"Sunday School","date":"April 16, 2020"},"excerpt":"","content":"\n![SundaySchool](SundaySchool.png)\n\n**Sunday School was established in 1990.**\n\nSunday schools in Sri Lanka was initiated by the Catholic mission soon after receiving  independence due to the reason of all the catholic schools were taken under the government and in order to give more emphasys to the religion, the catholic mission initiated Sunday schools at the time of Cardinal Cooray and with the inputs of Rev Fr. D.J. Anthoney.  Then this system was networked through the island via a center of catechism.  Sooner the Buddhists too followed this system as per the history.\n\nSunday School in Bambalapitiya parish was in active for a quite a long time.  However it was revamped in the year 2008 at the time of centenary year of the parish.  This includes;   Installing 11 teachers;  identifying all 3 mediums (Sinhala/English & Tamil) to be facilitated, initiating a the 10.30 mass as the childrens mass are 3 mile stones taken place at this stage.  Today our Sunday school has approximately 270 children and 33 teachers from KG to year 11 in 3 mediums.\n\nDespite investing many hours in hard work in preparing and acquiring knowledge each week the following activities are being conducted by the Sunday School teams.\n\nThe Lenten Pilgrimage, Christmas party, Celebrating Children’s day in Tewatte, Nativity play,  Bible quiz programs etc….\n\nFollowing is the volunteer teachers past and present who have contributed to the Sunday school in different ways.\n\n\n<table class=\"subpage-table\">\n  <tr>\n   <td><strong>Senior teachers and other supporters–past and present</strong>\n   </td>\n   <td><strong>Young teachers – past and present</strong>\n   </td>\n  </tr>\n  <tr>\n   <td>Ajantha Manthri\n      <br />\n      Amali de Silva\n      <br />\n      Anne Seneviratne\n      <br />\n      Ashanti Fernando\n      <br />\n      Chrishanthi Chelliah\n      <br />\n      Dinali De Silva\n      <br />\n      Felina\n      <br />\n      Ganga Jasenthuliyana\n      <br />\n      Geethika Amaratunga\n      <br />\n      Goretti Paiva\n      <br />\n      Imalka Bosco\n      <br />\n      Jacinta Jayasekera\n      <br />\n      Karan Bird\n      <br />\n      Melanie Nanayakkara\n      <br />\n      Manel De Alwis\n      <br />\n      Michelle Fonseka\n      <br />\n      Monisha Cruez\n      <br />\n      Nadishani Makalanda\n      <br />\n      Nilukshi Fonseka\n      <br />\n      Nirasha Gomez\n      <br />\n      Nirmala Joseph\n      <br />\n      Niroshani Wanniarachchi\n      <br />\n      Pravinda David\n      <br />\n      Rukshini Micheal\n      <br />\n      Ruwanmalie\n      <br />\n      Shahan Micheal\n      <br />\n      Shalini Perera\n      <br />\n      Sharron De Alwis\n      <br />\n      Sharron Steinwall\n      <br />\n      Sr Himali\n      <br />\n      Sr Sujeewa\n      <br />\n      Sujeewa\n      <br />\n      Nadeeshani Makalanda\n      <br />\n      Virginia Daniel\n   </td>\n   <td>Susal Dabera\n      <br />\n      Senuri Dabera\n      <br />\n      Anithra Lihinikaduwa\n      <br />\n      Anik De Mel\n      <br />\n      Levin Dharmawardana\n      <br />\n      Chathura De Silva\n      <br />\n      Nayomi Makalanda\n      <br />\n      Priyandan Francis\n      <br />\n      Sanchia Steinwall\n      <br />\n      Amandi Kotelawala\n      <br />\n      Sanoli Krishnan\n      <br />\n      Aneesha Henry\n      <br />\n      Shammara Fonseka\n      <br />\n      Shauntel Soris\n      <br />\n      Shuntel Fonseca\n   </td>\n  </tr>\n</table>\n\n<br />\n The principal of the sunday school is the parish priest assisted with 3 coordinators for each medium. \n\n **Contact Information –**\n\nEnglish Medium head teacher – Nilukshi Fonseka 077-770-5500 \n\nTamil Medium head teacher – Ms. Rukshini -  077-248-8676\n\nSinhala Medium head teacher – Ganga Jasenthuliyana – 077-311-8101\n\n"},"nextPost":{"slug":"choirs","frontmatter":{"title":"Parish Choir","description":"Parish Choir","date":"April 16, 2020"},"excerpt":"","content":"\nThe Parish choir sings at the 7.00am and 6.00pm mass on every\n\n\nSunday. This choir has been part of the parish since the inception\n\n\nof the church.  This choir sings for church functions, weddings, requiem masses, anniversary services and so on. We have 11 members in the choir. Please contact the choir coordinator for booking for any events. \n\n\nChoir coordinator – Mrs. Joyce Henry\n\n\nOrganist – Mrs. Surani Mendis\n\n\n**Contact Us / Join us:**\n\nMrs. Joyce Henry 2506186\n\nMrs. Suwini Abesundara 2582895, 0775917000\n\n\n## Youth Choir\n\nThe Youth Choir was formed in 2014 under the. Then parish priest, Rev. Fr. Sunil De Silva. The need for youth participation at services was the primary objective of this group. Around 5 members accompanied and led by Nuran Gomez was the Initial.choir. This choir sings for 2 masses ......every alternate week on a Saturday at 6.15 pm.\n\n\nSanchia Steinwall - coordinator \n\n\n* Takes part in joint choir services of the  church.\n\n\n* Takes part in the parish Christmas carols\n\n\n* Sings for the 6.15 pm , every alternate saturday.\n\n\n**Contact Us / Join us:**\n\n\nsanchiasteinwall [at] gmail.com\n\n\nnurangomez [at] hotmail.com   0712738255\n\n## Childrens Choir\n\nThe need for a children's choir arose due to commencing of a children's mass at 10.30 am which commenced in 2008 under the then parish priest ..Rev. Fr. Srian Ranasinghe. Members from Sunday school were invited to join after an audition..\n\n\nCurrently...we have around 25 members who sing with us for the 10.30 am mass  \n\n\nChoir coordinator- Nirasha Gomez\n\n* sings for 10.30 mass\n* Takes part in Parish carols\n* Accompanies the Nativity play.\n* Sings for first Holy communion service \n\n\nWe hope to organise a professional to come and train the children once a month so as to cultivate their interest further and gear them to later join the youth choir \n\n**Contact Us / Join us:**\n\nNirasha \n0777818970 WhatsApp \n0777280759\n\n\nnirashagomez [at] hotmail.com"}},"__N_SSG":true}